# Part-4 Basic Data Manegement

# 4.1 An example

In [14]:
# create a dataframe
manager <- c(1,2,3,4,5)
date <- c('10/24/08','10/28/08','10/1/08','10/12/08','5/1/09')
country <- c('US','US','UK','UK','UK')
gender <- c('M','F','F','M','F')
age <- c(32,45,25,39,99)
q1 <- c(5,3,3,3,2)
q2 <- c(4,5,5,3,2)
q3 <- c(5,2,5,4,1)
q4 <- c(5,5,5,NA,2)
q5 <- c(5,5,2,NA,1)
leadership <- data.frame(manager, date, country, gender, age,
                        q1,q2,q3,q4,q5, stringsAsFactors=F)
leadership

  manager date     country gender age q1 q2 q3 q4 q5
1 1       10/24/08 US      M      32  5  4  5   5  5
2 2       10/28/08 US      F      45  3  5  2   5  5
3 3       10/1/08  UK      F      25  3  5  5   5  2
4 4       10/12/08 UK      M      39  3  3  4  NA NA
5 5       5/1/09   UK      F      99  2  2  1   2  1

In [4]:
# operators:
# a %% b equals a mod b
# a %/% b equals a // b (in python)

## 4.1.1 Create new variables

In [36]:
mydata <- data.frame(x1=c(2,2,6,4),x2=c(3,4,2,8))

In [37]:
# method one
mydata$sumx1 <- mydata$x1 + mydata$x2
mydata$meanx1 <- (mydata$x1 + mydata$x2)/2

In [38]:
# method two
with(mydata, {
    mydata$sumx2 <<- x1 + x2
    mydata$meanx2 <<- (x1 + x2)/2
})

In [40]:
# method three
mydata <- transform(mydata,
                   sumx3 = x1 + x2,
                   meanx3 = (x1 + x2)/2)   # pay attention to =
mydata

  x1 x2 sumx1 meanx1 sumx2 meanx2 sumx3 meanx3
1 2  3   5    2.5     5    2.5     5    2.5
2 2  4   6    3.0     6    3.0     6    3.0
3 6  2   8    4.0     8    4.0     8    4.0
4 4  8  12    6.0    12    6.0    12    6.0

## 4.1.2 Re-code variables

In [59]:
# follow the example of 4.1
leadership$age[leadership$age == 99] <- NA

leadership$agecat[leadership$age > 75] <- 'Elder'
leadership$agecat[leadership$age >= 55 &
                 leadership$age <= 75] <- 'Middle Aged'
leadership$agecat[leadership$age < 55] <- 'Young'
leadership

  manager date     country gender age q1 q2 q3 q4 q5 agecat
1 1       10/24/08 US      M      32  5  4  5   5  5 Young
2 2       10/28/08 US      F      45  3  5  2   5  5 Young
3 3       10/1/08  UK      F      25  3  5  5   5  2 Young
4 4       10/12/08 UK      M      39  3  3  4  NA NA Young
5 5       5/1/09   UK      F      NA  2  2  1   2  1 NA

In [61]:
# you cam re-write the code in a simple way:
leadership <- within(leadership, {
    agecat <- NA
    agecat[age > 75] <- 'Elder'
    agecat[age >= 55 & age <= 75] <- 'Middle Aged'
    agecat[age < 55] <- 'Young'
})
leadership

  manager date     country gender age q1 q2 q3 q4 q5 agecat
1 1       10/24/08 US      M      32  5  4  5   5  5 Young
2 2       10/28/08 US      F      45  3  5  2   5  5 Young
3 3       10/1/08  UK      F      25  3  5  5   5  2 Young
4 4       10/12/08 UK      M      39  3  3  4  NA NA Young
5 5       5/1/09   UK      F      NA  2  2  1   2  1 NA

### notice that within() enables you to modify data in dataframe while with() can not

In [49]:
# more methods please refer to car$recode() & doBy$recodevar()

## 4.1.3 Re-name variables

In [50]:
# a simple way in IDE is function fix()

# and also other coding methods like reshape$rename()

## 4.1.4 Missing values

In [51]:
# NA:  Not Available
# NaN: Not a Number

y <- c(1,2,3,NA)
is.na(y)

[1] FALSE FALSE FALSE  TRUE

In [52]:
# functions like sum() has a parameter to handle missing values
x <- c(1,2,NA,3)
y <- sum(x, na.rm=T)
y

[1] 6

In [62]:
# function na.omit() can delete a row which lies missing values
newdata <- na.omit(leadership)
newdata

  manager date     country gender age q1 q2 q3 q4 q5 agecat
1 1       10/24/08 US      M      32  5  4  5  5  5  Young
2 2       10/28/08 US      F      45  3  5  2  5  5  Young
3 3       10/1/08  UK      F      25  3  5  5  5  2  Young

## 4.1.5 Dates

In [1]:
# date is first imported as a string
# then use function as.Date(x, 'import_format') to transfer
# par: import_format:
# %d: 01-30
# %a: Mon
# %A: Monday
# %m: 01~12  (month)
# %b: Jan
# %B: January
# %y: 17  (year)
# %Y: 2017

In [2]:
# default format
mydates <- as.Date(c('2007-06-22','2004-02-13'))
mydates

[1] "2007-06-22" "2004-02-13"

In [13]:
# example
strDates <- c('01/05/1965','08/16/1975')
dates <- as.Date(strDates, '%m/%d/&Y')
dates

[1] NA NA

In [11]:
myformat <- '%m/%d/%y'
leadership$date <- as.Date(leadership$date, myformat)
leadership

  manager date       country gender age q1 q2 q3 q4 q5
1 1       2008-10-24 US      M      32  5  4  5   5  5
2 2       2008-10-28 US      F      45  3  5  2   5  5
3 3       2008-10-01 UK      F      25  3  5  5   5  2
4 4       2008-10-12 UK      M      39  3  3  4  NA NA
5 5       2009-05-01 UK      F      99  2  2  1   2  1

In [17]:
# get todays date
Sys.Date()
date()

[1] "2017-09-13"

[1] "Wed Sep 13 19:09:57 2017"

In [20]:
# show todays date
today <- Sys.Date()
format(today, format='%B %d %Y')
format(today, format='%A')

[1] "九月 13 2017"

[1] "星期三"

### numerical dates can be calculated

In [21]:
startdate <- as.Date('2004-02-13')
enddate <- as.Date('2011-01-22')
days <- enddate - startdate
days

Time difference of 2535 days

In [32]:
# also use function difftime()
today <- Sys.Date()
birth <- as.Date('2007-03-14')
difftime(today, birth, unit='weeks')

Time difference of 548 weeks

In [33]:
# also you can use function as.character() 
# to transfer date into characters

# 4.2 Class transformation

In [34]:
# for example, normally if you add a string to 
# a numerical vector, then it will transfer into 
# a characteristic one

# judge               transfer
# is.numeric()        as.numeric()
# is character()      as.character()
# is.vector()         as.vector()
# is.matrix()         as.matrix()
# is.data.frame()     as.data.frame()
# is.factor()         as.factor()
# is.logical()        as.logical()

In [36]:
# for example
a <- c(1,2,3)
is.numeric(a)

[1] TRUE

In [38]:
b <- as.character(a)
b
is.numeric(b)
is.vector(b)
is.character(b)

[1] "1" "2" "3"

[1] FALSE

[1] TRUE

[1] TRUE

### is.datatype() will be a strong tool together with "if"

# 4.3 Data sorting

In [41]:
# with function ordeR()
newdata <- leadership[order(leadership$age),]
newdata # pay attention to the comma after order()

  manager date     country gender age q1 q2 q3 q4 q5
3 3       10/1/08  UK      F      25  3  5  5   5  2
1 1       10/24/08 US      M      32  5  4  5   5  5
4 4       10/12/08 UK      M      39  3  3  4  NA NA
2 2       10/28/08 US      F      45  3  5  2   5  5
5 5       5/1/09   UK      F      99  2  2  1   2  1

In [42]:
with(leadership, {
    newdata <<- leadership[order(gender, age),]
})
newdata

  manager date     country gender age q1 q2 q3 q4 q5
3 3       10/1/08  UK      F      25  3  5  5   5  2
2 2       10/28/08 US      F      45  3  5  2   5  5
5 5       5/1/09   UK      F      99  2  2  1   2  1
1 1       10/24/08 US      M      32  5  4  5   5  5
4 4       10/12/08 UK      M      39  3  3  4  NA NA

In [43]:
with(leadership, {
    newdata <<- leadership[order(gender, -age),]
})
newdata

  manager date     country gender age q1 q2 q3 q4 q5
5 5       5/1/09   UK      F      99  2  2  1   2  1
2 2       10/28/08 US      F      45  3  5  2   5  5
3 3       10/1/08  UK      F      25  3  5  5   5  2
4 4       10/12/08 UK      M      39  3  3  4  NA NA
1 1       10/24/08 US      M      32  5  4  5   5  5

# 4.4 Merge Data

## 4.4.1 Add cols

In [45]:
# with function merge()
# total <- merge(dataframeA, dataframeB, by='ID')

# if you just want to merge two in one
# total <- cbind(dataframeA, dataframeB)
# please check that the two dataframes 
#     have the same number of rows
#     and the same sort of every variables

## 4.4.2 Add rows

In [46]:
# familiar with above
# total <- rbind(dataframeA, dataframeB)
# please check that the two dataframes 
#     have the same number of variables
# if there are some variables in B which are not included in A
#     delete those variables in B or add NA to A
#     before you bind them together

# 4.5 Get sub-sets

## 4.5.1 Maintain some variables

In [54]:
newdata <- leadership[, c(6:10)]   # a deep copy
newdata
leadership[5, 10] <- 0
newdata
leadership
leadership[5, 10] <- 1

  q1 q2 q3 q4 q5
1 5  4  5   5  5
2 3  5  2   5  5
3 3  5  5   5  2
4 3  3  4  NA NA
5 2  2  1   2  1

  q1 q2 q3 q4 q5
1 5  4  5   5  5
2 3  5  2   5  5
3 3  5  5   5  2
4 3  3  4  NA NA
5 2  2  1   2  1

  manager date     country gender age q1 q2 q3 q4 q5
1 1       10/24/08 US      M      32  5  4  5   5  5
2 2       10/28/08 US      F      45  3  5  2   5  5
3 3       10/1/08  UK      F      25  3  5  5   5  2
4 4       10/12/08 UK      M      39  3  3  4  NA NA
5 5       5/1/09   UK      F      99  2  2  1   2  0

In [55]:
myvars <- c('q1','q2','q3','q4','q5')
newdata <- leadership[myvars]
newdata

  q1 q2 q3 q4 q5
1 5  4  5   5  5
2 3  5  2   5  5
3 3  5  5   5  2
4 3  3  4  NA NA
5 2  2  1   2  1

## 4.5.2 Discard some variables

In [56]:
# for example
myvars <- names(leadership) %in% c('q3','q4')
newdata <- leadership[!myvars]
newdata

  manager date     country gender age q1 q2 q5
1 1       10/24/08 US      M      32  5  4   5
2 2       10/28/08 US      F      45  3  5   5
3 3       10/1/08  UK      F      25  3  5   2
4 4       10/12/08 UK      M      39  3  3  NA
5 5       5/1/09   UK      F      99  2  2   1

In [57]:
# or you can run this
newdata2 <- leadership[c(-8, -9)]
newdata2

  manager date     country gender age q1 q2 q5
1 1       10/24/08 US      M      32  5  4   5
2 2       10/28/08 US      F      45  3  5   5
3 3       10/1/08  UK      F      25  3  5   2
4 4       10/12/08 UK      M      39  3  3  NA
5 5       5/1/09   UK      F      99  2  2   1

In [58]:
# or you can run this
# leadership$q3 <- leadership$q4 <- NULL
# however, this will change the leadership dataframe

## 4.5.3 Data selecting

In [2]:
newdata <- leadership[1:3,]
newdata
newdata <- leadership[which(leadership$gender=='M' &
                           leadership$age > 30),]
newdata

  manager date     country gender age q1 q2 q3 q4 q5
1 1       10/24/08 US      M      32  5  4  5  5  5
2 2       10/28/08 US      F      45  3  5  2  5  5
3 3       10/1/08  UK      F      25  3  5  5  5  2

  manager date     country gender age q1 q2 q3 q4 q5
1 1       10/24/08 US      M      32  5  4  5   5  5
4 4       10/12/08 UK      M      39  3  3  4  NA NA

### function which() turns logical vector into indexes

In [6]:
leadership$date <- as.Date(leadership$date, '%m/%d/%y')
startdate <- as.Date('2009-01-01')
enddate <- as.Date('2009-10-31')
newdata <- leadership[which(leadership$date >= startdate &
                           leadership$date <= enddate),]
newdata

  manager date       country gender age q1 q2 q3 q4 q5
5 5       2009-05-01 UK      F      99  2  2  1  2  1

### function subset()

In [8]:
newdata <- subset(leadership, age >= 35 | age < 24,
                 select=c(q1,q2,q3,q4))
newdata
newdata <- subset(leadership, gender == 'M' & age > 25,
                 select=gender:q4)
newdata

  q1 q2 q3 q4
2 3  5  2   5
4 3  3  4  NA
5 2  2  1   2

  gender age q1 q2 q3 q4
1 M      32  5  4  5   5
4 M      39  3  3  4  NA

In [10]:
# pay attention to parameter: select

# 4.6 Sampling

In [12]:
# in datamining & machine learning, you will need a trainning
# set & a testing set, so you should do some sampling

In [17]:
mysample <- leadership[sample(1:nrow(leadership), 
                              3, replace=F),]
mysample

  manager date     country gender age q1 q2 q3 q4 q5
3 3       10/1/08  UK      F      25  3  5  5   5  2
4 4       10/12/08 UK      M      39  3  3  4  NA NA
2 2       10/28/08 US      F      45  3  5  2   5  5

In [18]:
# there are three pars within sample(par1, par2, par3)
# par1: the dataset to sample
# par2: the number of samples
# par3: T means take-and-back, F means take-no-back

# more information about sampling,
#             please refer to package sampling
# more information about data analysis,
#             please refer to package survey

# 4.7 Create Dataframe with SQL

In [20]:
# remain to be learnt